; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-8)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 )
(:init
(ontable b1)
(on b2 b7)
(on b3 b1)
(on b4 b6)
(on b5 b8)
(ontable b6)
(on b7 b5)
(ontable b8)
(clear b2)
(clear b3)
(clear b4)
)
(:goal
(and
(on b1 b4)
(on b2 b8)
(on b4 b7)
(on b5 b2)
(on b6 b5)
(on b8 b1))
)
)

; plan
1. (move-b-to-t b2 b7)
   deleted: (on b2 b7)
   added: (ontable b2) (clear b7)
   goals met: 0 of 6
2. (move-b-to-t b7 b5)
   deleted: (on b7 b5)
   added: (ontable b7) (clear b5)
   goals met: 0 of 6
3. (move-b-to-b b4 b6 b7)
   deleted: (clear b7) (on b4 b6)
   added: (on b4 b7) (clear b6)
   goals met: 1 of 6
4. (move-b-to-b b3 b1 b3)
   deleted: (clear b3) (on b3 b1)
   added: (on b3 b3) (clear b1)
   goals met: 1 of 6
5. (move-b-to-b b5 b8 b6)
   deleted: (clear b6) (on b5 b8)
   added: (on b5 b6) (clear b8)
   goals met: 1 of 6
6. (move-t-to-b b1 b4)
   deleted: (clear b4) (ontable b1)
   added: (on b1 b4)
   goals met: 2 of 6
7. (move-t-to-b b8 b1)
   deleted: (clear b1) (ontable b8)
   added: (on b8 b1)
   goals met: 3 of 6
8. (move-t-to-b b2 b8)
   deleted: (clear b8) (ontable b2)
   added: (on b2 b8)
   goals met: 4 of 6
9. (move-b-to-b b5 b6 b2)
   deleted: (clear b2) (on b5 b6)
   added: (on b5 b2) (clear b6)
   goals met: 5 of 6
10. (move-t-to-b b6 b5)
   deleted: (clear b5) (ontable b6)
   added: (on b6 b5)
   goals met: 6 of 6
